**************************  INFINITE CYCLES  **************************
* It is possible to recursively call macro from itself.
* The number of calls is limited in HLASM:
         MACRO
         MAC
         MAC
         MEND 

         MAC

**************************  RUBBISH SKIPPING  *************************
         AGO   .SKIP
         Anything in here is just skipped
         And it is still valid hlasm source code
.SKIP    ANOP
